<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
7
5
2
Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_24 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_24 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_8 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_16 (Dense)             (None, 64)                573504
_________________________________________________________________
dense_17 (Dense)             (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
5/5 [==============================] - 1s 253ms/step - loss: 2.3189 - accuracy: 0.1122 - val_loss: 2.2780 - val_accuracy: 0.1750
Epoch 2/30
5/5 [==============================] - 1s 212ms/step - loss: 2.2598 - accuracy: 0.1403 - val_loss: 2.1957 - val_accuracy: 0.1850
Epoch 3/30
5/5 [==============================] - 1s 209ms/step - loss: 2.1647 - accuracy: 0.2064 - val_loss: 2.0915 - val_accuracy: 0.2050
Epoch 4/30
5/5 [==============================] - 1s 211ms/step - loss: 2.1213 - accuracy: 0.1824 - val_loss: 2.0032 - val_accuracy: 0.2750
Epoch 5/30
5/5 [==============================] - 1s 212ms/step - loss: 2.0278 - accuracy: 0.2505 - val_loss: 2.0668 - val_accuracy: 0.2600
Epoch 6/30
5/5 [==============================] - 1s 207ms/step - loss: 1.9749 - accuracy: 0.2645 - val_loss: 1.9276 - val_accuracy: 0.2750
Epoch 7/30
5/5 [==============================] - 1s 212ms/step - loss: 1.8814 - accuracy: 0.2846 - val_loss: 1.7645 - val_accuracy: 0.3850
Epoch 8/30
5/5 [==============================] - 1s 210ms/step - loss: 1.8054 - accuracy: 0.3487 - val_loss: 1.6499 - val_accuracy: 0.4150
Epoch 9/30
5/5 [==============================] - 1s 215ms/step - loss: 1.6973 - accuracy: 0.3908 - val_loss: 1.7746 - val_accuracy: 0.3350
Epoch 10/30
5/5 [==============================] - 1s 212ms/step - loss: 1.6761 - accuracy: 0.4008 - val_loss: 1.6611 - val_accuracy: 0.4000
Epoch 11/30
5/5 [==============================] - 1s 209ms/step - loss: 1.6750 - accuracy: 0.3507 - val_loss: 1.6805 - val_accuracy: 0.3450
Epoch 12/30
5/5 [==============================] - 1s 215ms/step - loss: 1.6011 - accuracy: 0.4168 - val_loss: 1.6014 - val_accuracy: 0.4000
Epoch 13/30
5/5 [==============================] - 1s 217ms/step - loss: 1.5570 - accuracy: 0.4489 - val_loss: 1.5397 - val_accuracy: 0.4350
Epoch 14/30
5/5 [==============================] - 1s 217ms/step - loss: 1.5018 - accuracy: 0.4429 - val_loss: 1.5057 - val_accuracy: 0.4200
Epoch 15/30
5/5 [==============================] - 1s 211ms/step - loss: 1.4799 - accuracy: 0.4549 - val_loss: 1.4263 - val_accuracy: 0.5100
Epoch 16/30
5/5 [==============================] - 1s 213ms/step - loss: 1.4432 - accuracy: 0.4910 - val_loss: 1.3996 - val_accuracy: 0.5350
Epoch 17/30
5/5 [==============================] - 1s 215ms/step - loss: 1.3936 - accuracy: 0.5170 - val_loss: 1.3696 - val_accuracy: 0.5250
Epoch 18/30
5/5 [==============================] - 1s 212ms/step - loss: 1.3704 - accuracy: 0.5070 - val_loss: 1.3400 - val_accuracy: 0.5200
Epoch 19/30
5/5 [==============================] - 1s 214ms/step - loss: 1.3375 - accuracy: 0.4890 - val_loss: 1.3584 - val_accuracy: 0.5200
Epoch 20/30
5/5 [==============================] - 1s 214ms/step - loss: 1.2901 - accuracy: 0.5190 - val_loss: 1.4582 - val_accuracy: 0.4750
Epoch 21/30
5/5 [==============================] - 1s 209ms/step - loss: 1.3227 - accuracy: 0.5351 - val_loss: 1.1764 - val_accuracy: 0.6000
Epoch 22/30
5/5 [==============================] - 1s 214ms/step - loss: 1.3034 - accuracy: 0.5050 - val_loss: 1.3171 - val_accuracy: 0.5000
Epoch 23/30
5/5 [==============================] - 1s 207ms/step - loss: 1.2741 - accuracy: 0.5411 - val_loss: 1.2890 - val_accuracy: 0.5250
Epoch 24/30
5/5 [==============================] - 1s 211ms/step - loss: 1.2416 - accuracy: 0.5651 - val_loss: 1.2312 - val_accuracy: 0.5700
Epoch 25/30
5/5 [==============================] - 1s 212ms/step - loss: 1.2079 - accuracy: 0.5711 - val_loss: 1.3885 - val_accuracy: 0.4950
Epoch 26/30
5/5 [==============================] - 1s 213ms/step - loss: 1.2196 - accuracy: 0.5471 - val_loss: 1.1221 - val_accuracy: 0.5500
Epoch 27/30
5/5 [==============================] - 1s 216ms/step - loss: 1.1987 - accuracy: 0.5491 - val_loss: 1.1798 - val_accuracy: 0.5650
Epoch 28/30
5/5 [==============================] - 1s 212ms/step - loss: 1.2529 - accuracy: 0.5311 - val_loss: 1.2759 - val_accuracy: 0.5200
Epoch 29/30
5/5 [==============================] - 1s 211ms/step - loss: 1.1732 - accuracy: 0.5731 - val_loss: 1.1959 - val_accuracy: 0.5150
Epoch 30/30
5/5 [==============================] - 1s 217ms/step - loss: 1.1514 - accuracy: 0.5912 - val_loss: 1.1234 - val_accuracy: 0.5900
1/1 [==============================] - 0s 965us/step - loss: 2.0000 - accuracy: 0.3244
testing
2.000019073486328
0.3244147300720215