<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
70
49
21
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_15 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_15 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_5 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_10 (Dense)             (None, 64)                573504
_________________________________________________________________
dense_11 (Dense)             (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
49/49 [==============================] - 1s 26ms/step - loss: 2.3015 - accuracy: 0.1391 - val_loss: 2.2217 - val_accuracy: 0.3048
Epoch 2/30
49/49 [==============================] - 1s 23ms/step - loss: 2.1366 - accuracy: 0.2413 - val_loss: 2.0579 - val_accuracy: 0.2333
Epoch 3/30
49/49 [==============================] - 1s 23ms/step - loss: 2.0475 - accuracy: 0.2577 - val_loss: 1.9462 - val_accuracy: 0.2429
Epoch 4/30
49/49 [==============================] - 1s 23ms/step - loss: 1.9800 - accuracy: 0.2597 - val_loss: 1.8013 - val_accuracy: 0.3429
Epoch 5/30
49/49 [==============================] - 1s 23ms/step - loss: 1.7977 - accuracy: 0.3354 - val_loss: 2.0738 - val_accuracy: 0.2286
Epoch 6/30
49/49 [==============================] - 1s 24ms/step - loss: 1.8254 - accuracy: 0.3292 - val_loss: 1.8983 - val_accuracy: 0.3190
Epoch 7/30
49/49 [==============================] - 1s 24ms/step - loss: 1.5970 - accuracy: 0.3885 - val_loss: 1.4222 - val_accuracy: 0.4857
Epoch 8/30
49/49 [==============================] - 1s 23ms/step - loss: 1.5494 - accuracy: 0.4560 - val_loss: 1.5029 - val_accuracy: 0.4000
Epoch 9/30
49/49 [==============================] - 1s 23ms/step - loss: 1.4599 - accuracy: 0.4683 - val_loss: 1.3846 - val_accuracy: 0.5048
Epoch 10/30
49/49 [==============================] - 1s 24ms/step - loss: 1.4879 - accuracy: 0.4417 - val_loss: 1.3665 - val_accuracy: 0.4381
Epoch 11/30
49/49 [==============================] - 1s 24ms/step - loss: 1.3963 - accuracy: 0.4744 - val_loss: 1.3702 - val_accuracy: 0.5048
Epoch 12/30
49/49 [==============================] - 1s 23ms/step - loss: 1.3602 - accuracy: 0.4663 - val_loss: 1.4229 - val_accuracy: 0.4571
Epoch 13/30
49/49 [==============================] - 1s 23ms/step - loss: 1.3515 - accuracy: 0.5112 - val_loss: 1.1527 - val_accuracy: 0.5857
Epoch 14/30
49/49 [==============================] - 1s 23ms/step - loss: 1.3087 - accuracy: 0.5460 - val_loss: 1.1298 - val_accuracy: 0.5952
Epoch 15/30
49/49 [==============================] - 1s 24ms/step - loss: 1.1564 - accuracy: 0.5890 - val_loss: 1.1563 - val_accuracy: 0.5952
Epoch 16/30
49/49 [==============================] - 1s 23ms/step - loss: 1.1841 - accuracy: 0.5297 - val_loss: 1.2213 - val_accuracy: 0.5286
Epoch 17/30
49/49 [==============================] - 1s 23ms/step - loss: 1.1096 - accuracy: 0.6176 - val_loss: 1.0425 - val_accuracy: 0.6190
Epoch 18/30
49/49 [==============================] - 1s 24ms/step - loss: 1.0606 - accuracy: 0.6012 - val_loss: 0.9439 - val_accuracy: 0.6905
Epoch 19/30
49/49 [==============================] - 1s 23ms/step - loss: 1.0315 - accuracy: 0.6442 - val_loss: 0.8696 - val_accuracy: 0.7333
Epoch 20/30
49/49 [==============================] - 1s 23ms/step - loss: 0.9336 - accuracy: 0.6524 - val_loss: 0.8027 - val_accuracy: 0.7524
Epoch 21/30
49/49 [==============================] - 1s 22ms/step - loss: 0.9440 - accuracy: 0.6646 - val_loss: 0.8686 - val_accuracy: 0.7238
Epoch 22/30
49/49 [==============================] - 1s 23ms/step - loss: 0.8462 - accuracy: 0.6953 - val_loss: 0.8031 - val_accuracy: 0.7333
Epoch 23/30
49/49 [==============================] - 1s 23ms/step - loss: 0.8442 - accuracy: 0.6871 - val_loss: 0.9013 - val_accuracy: 0.6952
Epoch 24/30
49/49 [==============================] - 1s 22ms/step - loss: 0.7392 - accuracy: 0.7403 - val_loss: 0.8164 - val_accuracy: 0.7476
Epoch 25/30
49/49 [==============================] - 1s 23ms/step - loss: 0.6695 - accuracy: 0.7566 - val_loss: 0.6751 - val_accuracy: 0.7381
Epoch 26/30
49/49 [==============================] - 1s 23ms/step - loss: 0.6395 - accuracy: 0.7894 - val_loss: 0.5525 - val_accuracy: 0.8000
Epoch 27/30
49/49 [==============================] - 1s 24ms/step - loss: 0.5317 - accuracy: 0.8180 - val_loss: 0.5800 - val_accuracy: 0.8000
Epoch 28/30
49/49 [==============================] - 1s 24ms/step - loss: 0.5295 - accuracy: 0.8160 - val_loss: 0.4311 - val_accuracy: 0.8619
Epoch 29/30
49/49 [==============================] - 1s 23ms/step - loss: 0.4836 - accuracy: 0.8344 - val_loss: 0.3764 - val_accuracy: 0.8714
Epoch 30/30
49/49 [==============================] - 1s 23ms/step - loss: 0.4123 - accuracy: 0.8569 - val_loss: 0.2658 - val_accuracy: 0.9143
1/1 [==============================] - 0s 918us/step - loss: 3.4839 - accuracy: 0.2575
testing
3.4838860034942627
0.25752508640289307