<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
140
98
42
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_12 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_12 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_4 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_8 (Dense)              (None, 64)                573504
_________________________________________________________________
dense_9 (Dense)              (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
98/98 [==============================] - 1s 13ms/step - loss: 2.2773 - accuracy: 0.1391 - val_loss: 2.1956 - val_accuracy: 0.1429
Epoch 2/30
98/98 [==============================] - 1s 12ms/step - loss: 2.1444 - accuracy: 0.1902 - val_loss: 2.0593 - val_accuracy: 0.2714
Epoch 3/30
98/98 [==============================] - 1s 12ms/step - loss: 2.0531 - accuracy: 0.2740 - val_loss: 1.9750 - val_accuracy: 0.2762
Epoch 4/30
98/98 [==============================] - 1s 12ms/step - loss: 1.9661 - accuracy: 0.2822 - val_loss: 1.8559 - val_accuracy: 0.2905
Epoch 5/30
98/98 [==============================] - 1s 12ms/step - loss: 1.9849 - accuracy: 0.2679 - val_loss: 1.8310 - val_accuracy: 0.3524
Epoch 6/30
98/98 [==============================] - 1s 12ms/step - loss: 1.8465 - accuracy: 0.3252 - val_loss: 1.9542 - val_accuracy: 0.2905
Epoch 7/30
98/98 [==============================] - 1s 12ms/step - loss: 1.7573 - accuracy: 0.3640 - val_loss: 1.7712 - val_accuracy: 0.4048
Epoch 8/30
98/98 [==============================] - 1s 12ms/step - loss: 1.7427 - accuracy: 0.3681 - val_loss: 1.6842 - val_accuracy: 0.4429
Epoch 9/30
98/98 [==============================] - 1s 11ms/step - loss: 1.7325 - accuracy: 0.3681 - val_loss: 1.6386 - val_accuracy: 0.3857
Epoch 10/30
98/98 [==============================] - 1s 12ms/step - loss: 1.7393 - accuracy: 0.3742 - val_loss: 1.5703 - val_accuracy: 0.4429
Epoch 11/30
98/98 [==============================] - 1s 12ms/step - loss: 1.5532 - accuracy: 0.4192 - val_loss: 1.5418 - val_accuracy: 0.4571
Epoch 12/30
98/98 [==============================] - 1s 12ms/step - loss: 1.5205 - accuracy: 0.4397 - val_loss: 1.4814 - val_accuracy: 0.4333
Epoch 13/30
98/98 [==============================] - 1s 12ms/step - loss: 1.4813 - accuracy: 0.4601 - val_loss: 1.4192 - val_accuracy: 0.4952
Epoch 14/30
98/98 [==============================] - 1s 12ms/step - loss: 1.4362 - accuracy: 0.4928 - val_loss: 1.3561 - val_accuracy: 0.5000
Epoch 15/30
98/98 [==============================] - 1s 12ms/step - loss: 1.3040 - accuracy: 0.5358 - val_loss: 1.2358 - val_accuracy: 0.5714
Epoch 16/30
98/98 [==============================] - 1s 12ms/step - loss: 1.3388 - accuracy: 0.5337 - val_loss: 1.1940 - val_accuracy: 0.5762
Epoch 17/30
98/98 [==============================] - 1s 11ms/step - loss: 1.3247 - accuracy: 0.5194 - val_loss: 1.2377 - val_accuracy: 0.5762
Epoch 18/30
98/98 [==============================] - 1s 12ms/step - loss: 1.2813 - accuracy: 0.5133 - val_loss: 1.1326 - val_accuracy: 0.6000
Epoch 19/30
98/98 [==============================] - 1s 12ms/step - loss: 1.1430 - accuracy: 0.5828 - val_loss: 1.0616 - val_accuracy: 0.6190
Epoch 20/30
98/98 [==============================] - 1s 12ms/step - loss: 1.1588 - accuracy: 0.5644 - val_loss: 0.9703 - val_accuracy: 0.6524
Epoch 21/30
98/98 [==============================] - 1s 12ms/step - loss: 1.1100 - accuracy: 0.5951 - val_loss: 1.1837 - val_accuracy: 0.6048
Epoch 22/30
98/98 [==============================] - 1s 12ms/step - loss: 1.0075 - accuracy: 0.6503 - val_loss: 0.9000 - val_accuracy: 0.6762
Epoch 23/30
98/98 [==============================] - 1s 12ms/step - loss: 0.9876 - accuracy: 0.6544 - val_loss: 0.9106 - val_accuracy: 0.6762
Epoch 24/30
98/98 [==============================] - 1s 12ms/step - loss: 0.9201 - accuracy: 0.6687 - val_loss: 0.8136 - val_accuracy: 0.7286
Epoch 25/30
98/98 [==============================] - 1s 12ms/step - loss: 0.8345 - accuracy: 0.7157 - val_loss: 0.8011 - val_accuracy: 0.7048
Epoch 26/30
98/98 [==============================] - 1s 12ms/step - loss: 0.7768 - accuracy: 0.7321 - val_loss: 0.8670 - val_accuracy: 0.6952
Epoch 27/30
98/98 [==============================] - 1s 11ms/step - loss: 0.7539 - accuracy: 0.7464 - val_loss: 0.7259 - val_accuracy: 0.7381
Epoch 28/30
98/98 [==============================] - 1s 12ms/step - loss: 0.5936 - accuracy: 0.7832 - val_loss: 0.5789 - val_accuracy: 0.7952
Epoch 29/30
98/98 [==============================] - 1s 12ms/step - loss: 0.5498 - accuracy: 0.8180 - val_loss: 0.6224 - val_accuracy: 0.7810
Epoch 30/30
98/98 [==============================] - 1s 12ms/step - loss: 0.5684 - accuracy: 0.7996 - val_loss: 0.4845 - val_accuracy: 0.8381
1/1 [==============================] - 0s 1ms/step - loss: 3.3301 - accuracy: 0.3144
testing
3.3300962448120117
0.31438127160072327