<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
233
164
69
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_6 (Conv2D)            (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_6 (Conv2D)            (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_2 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_4 (Dense)              (None, 64)                573504
_________________________________________________________________
dense_5 (Dense)              (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
164/164 [==============================] - 1s 7ms/step - loss: 2.2886 - accuracy: 0.1159 - val_loss: 2.3101 - val_accuracy: 0.1304
Epoch 2/30
164/164 [==============================] - 1s 7ms/step - loss: 2.2108 - accuracy: 0.1585 - val_loss: 2.1327 - val_accuracy: 0.1691
Epoch 3/30
164/164 [==============================] - 1s 7ms/step - loss: 2.0716 - accuracy: 0.2134 - val_loss: 2.1247 - val_accuracy: 0.1932
Epoch 4/30
164/164 [==============================] - 1s 7ms/step - loss: 2.0357 - accuracy: 0.2398 - val_loss: 1.8670 - val_accuracy: 0.3043
Epoch 5/30
164/164 [==============================] - 1s 7ms/step - loss: 1.9460 - accuracy: 0.2886 - val_loss: 1.8592 - val_accuracy: 0.3237
Epoch 6/30
164/164 [==============================] - 1s 7ms/step - loss: 1.8797 - accuracy: 0.3496 - val_loss: 1.9818 - val_accuracy: 0.2512
Epoch 7/30
164/164 [==============================] - 1s 7ms/step - loss: 1.7936 - accuracy: 0.3598 - val_loss: 1.7478 - val_accuracy: 0.3720
Epoch 8/30
164/164 [==============================] - 1s 7ms/step - loss: 1.7662 - accuracy: 0.3679 - val_loss: 1.6572 - val_accuracy: 0.3913
Epoch 9/30
164/164 [==============================] - 1s 7ms/step - loss: 1.7318 - accuracy: 0.3598 - val_loss: 1.6437 - val_accuracy: 0.4010
Epoch 10/30
164/164 [==============================] - 1s 7ms/step - loss: 1.6951 - accuracy: 0.3841 - val_loss: 1.6252 - val_accuracy: 0.4010
Epoch 11/30
164/164 [==============================] - 1s 7ms/step - loss: 1.6492 - accuracy: 0.4004 - val_loss: 1.5321 - val_accuracy: 0.4106
Epoch 12/30
164/164 [==============================] - 1s 7ms/step - loss: 1.6534 - accuracy: 0.4207 - val_loss: 1.5751 - val_accuracy: 0.4106
Epoch 13/30
164/164 [==============================] - 1s 7ms/step - loss: 1.5601 - accuracy: 0.4248 - val_loss: 1.4862 - val_accuracy: 0.4928
Epoch 14/30
164/164 [==============================] - 1s 7ms/step - loss: 1.5579 - accuracy: 0.4411 - val_loss: 1.4867 - val_accuracy: 0.4783
Epoch 15/30
164/164 [==============================] - 1s 7ms/step - loss: 1.5135 - accuracy: 0.4614 - val_loss: 1.4821 - val_accuracy: 0.4686
Epoch 16/30
164/164 [==============================] - 1s 7ms/step - loss: 1.4933 - accuracy: 0.4695 - val_loss: 1.3734 - val_accuracy: 0.5169
Epoch 17/30
164/164 [==============================] - 1s 7ms/step - loss: 1.4823 - accuracy: 0.4634 - val_loss: 1.4091 - val_accuracy: 0.4831
Epoch 18/30
164/164 [==============================] - 1s 7ms/step - loss: 1.3614 - accuracy: 0.5203 - val_loss: 1.3636 - val_accuracy: 0.4976
Epoch 19/30
164/164 [==============================] - 1s 7ms/step - loss: 1.4039 - accuracy: 0.5020 - val_loss: 1.3066 - val_accuracy: 0.5314
Epoch 20/30
164/164 [==============================] - 1s 7ms/step - loss: 1.3780 - accuracy: 0.5183 - val_loss: 1.3372 - val_accuracy: 0.5266
Epoch 21/30
164/164 [==============================] - 1s 7ms/step - loss: 1.3813 - accuracy: 0.5041 - val_loss: 1.2184 - val_accuracy: 0.5942
Epoch 22/30
164/164 [==============================] - 1s 7ms/step - loss: 1.3349 - accuracy: 0.5569 - val_loss: 1.2122 - val_accuracy: 0.6184
Epoch 23/30
164/164 [==============================] - 1s 7ms/step - loss: 1.2857 - accuracy: 0.5427 - val_loss: 1.2057 - val_accuracy: 0.5797
Epoch 24/30
164/164 [==============================] - 1s 7ms/step - loss: 1.2386 - accuracy: 0.5630 - val_loss: 1.1871 - val_accuracy: 0.6087
Epoch 25/30
164/164 [==============================] - 1s 7ms/step - loss: 1.1766 - accuracy: 0.5955 - val_loss: 1.2947 - val_accuracy: 0.5652
Epoch 26/30
164/164 [==============================] - 1s 7ms/step - loss: 1.1381 - accuracy: 0.5996 - val_loss: 1.0560 - val_accuracy: 0.6618
Epoch 27/30
164/164 [==============================] - 1s 7ms/step - loss: 1.0775 - accuracy: 0.6423 - val_loss: 1.0666 - val_accuracy: 0.6039
Epoch 28/30
164/164 [==============================] - 1s 7ms/step - loss: 1.1155 - accuracy: 0.6016 - val_loss: 1.1626 - val_accuracy: 0.5845
Epoch 29/30
164/164 [==============================] - 1s 7ms/step - loss: 1.1009 - accuracy: 0.6341 - val_loss: 1.0344 - val_accuracy: 0.6618
Epoch 30/30
164/164 [==============================] - 1s 7ms/step - loss: 1.0312 - accuracy: 0.6585 - val_loss: 0.9082 - val_accuracy: 0.6715
1/1 [==============================] - 0s 997us/step - loss: 2.7047 - accuracy: 0.3512
testing
2.7047035694122314
0.3511705696582794