 <TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
14
10
4
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_21 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_21 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_7 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_14 (Dense)             (None, 64)                573504
_________________________________________________________________
dense_15 (Dense)             (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
10/10 [==============================] - 1s 125ms/step - loss: 2.3020 - accuracy: 0.1142 - val_loss: 2.2155 - val_accuracy: 0.2150
Epoch 2/30
10/10 [==============================] - 1s 110ms/step - loss: 2.1543 - accuracy: 0.2044 - val_loss: 2.0535 - val_accuracy: 0.2000
Epoch 3/30
10/10 [==============================] - 1s 110ms/step - loss: 2.0148 - accuracy: 0.2605 - val_loss: 1.9741 - val_accuracy: 0.3050
Epoch 4/30
10/10 [==============================] - 1s 110ms/step - loss: 1.9180 - accuracy: 0.2986 - val_loss: 1.7984 - val_accuracy: 0.3350
Epoch 5/30
10/10 [==============================] - 1s 109ms/step - loss: 1.8436 - accuracy: 0.3046 - val_loss: 1.8726 - val_accuracy: 0.2900
Epoch 6/30
10/10 [==============================] - 1s 110ms/step - loss: 1.8154 - accuracy: 0.3246 - val_loss: 1.7703 - val_accuracy: 0.3650
Epoch 7/30
10/10 [==============================] - 1s 112ms/step - loss: 1.7223 - accuracy: 0.3527 - val_loss: 1.6518 - val_accuracy: 0.4300
Epoch 8/30
10/10 [==============================] - 1s 111ms/step - loss: 1.6224 - accuracy: 0.4108 - val_loss: 1.5594 - val_accuracy: 0.4550
Epoch 9/30
10/10 [==============================] - 1s 109ms/step - loss: 1.5987 - accuracy: 0.4128 - val_loss: 1.5685 - val_accuracy: 0.4250
Epoch 10/30
10/10 [==============================] - 1s 112ms/step - loss: 1.6288 - accuracy: 0.4108 - val_loss: 1.6250 - val_accuracy: 0.4200
Epoch 11/30
10/10 [==============================] - 1s 110ms/step - loss: 1.5813 - accuracy: 0.4128 - val_loss: 1.3576 - val_accuracy: 0.4950
Epoch 12/30
10/10 [==============================] - 1s 109ms/step - loss: 1.5046 - accuracy: 0.4549 - val_loss: 1.4044 - val_accuracy: 0.5100
Epoch 13/30
10/10 [==============================] - 1s 112ms/step - loss: 1.4336 - accuracy: 0.4749 - val_loss: 1.3976 - val_accuracy: 0.4950
Epoch 14/30
10/10 [==============================] - 1s 111ms/step - loss: 1.4279 - accuracy: 0.4709 - val_loss: 1.2838 - val_accuracy: 0.5450
Epoch 15/30
10/10 [==============================] - 1s 111ms/step - loss: 1.4215 - accuracy: 0.4589 - val_loss: 1.3736 - val_accuracy: 0.4650
Epoch 16/30
10/10 [==============================] - 1s 111ms/step - loss: 1.3179 - accuracy: 0.5150 - val_loss: 1.2931 - val_accuracy: 0.5000
Epoch 17/30
10/10 [==============================] - 1s 111ms/step - loss: 1.3016 - accuracy: 0.5230 - val_loss: 1.4230 - val_accuracy: 0.5100
Epoch 18/30
10/10 [==============================] - 1s 112ms/step - loss: 1.3092 - accuracy: 0.5371 - val_loss: 1.1810 - val_accuracy: 0.5450
Epoch 19/30
10/10 [==============================] - 1s 109ms/step - loss: 1.2829 - accuracy: 0.5090 - val_loss: 1.2062 - val_accuracy: 0.5700
Epoch 20/30
10/10 [==============================] - 1s 111ms/step - loss: 1.2493 - accuracy: 0.5471 - val_loss: 1.3251 - val_accuracy: 0.5100
Epoch 21/30
10/10 [==============================] - 1s 110ms/step - loss: 1.2562 - accuracy: 0.5431 - val_loss: 1.1744 - val_accuracy: 0.6050
Epoch 22/30
10/10 [==============================] - 1s 112ms/step - loss: 1.1958 - accuracy: 0.5671 - val_loss: 1.1803 - val_accuracy: 0.5600
Epoch 23/30
10/10 [==============================] - 1s 112ms/step - loss: 1.2388 - accuracy: 0.5651 - val_loss: 1.1793 - val_accuracy: 0.6050
Epoch 24/30
10/10 [==============================] - 1s 111ms/step - loss: 1.1532 - accuracy: 0.6132 - val_loss: 1.0614 - val_accuracy: 0.6400
Epoch 25/30
10/10 [==============================] - 1s 112ms/step - loss: 1.1160 - accuracy: 0.5872 - val_loss: 1.0577 - val_accuracy: 0.6250
Epoch 26/30
10/10 [==============================] - 1s 113ms/step - loss: 1.0704 - accuracy: 0.6192 - val_loss: 1.0500 - val_accuracy: 0.6350
Epoch 27/30
10/10 [==============================] - 1s 109ms/step - loss: 1.0214 - accuracy: 0.6353 - val_loss: 0.9992 - val_accuracy: 0.6350
Epoch 28/30
10/10 [==============================] - 1s 112ms/step - loss: 1.0196 - accuracy: 0.6112 - val_loss: 0.8215 - val_accuracy: 0.7250
Epoch 29/30
10/10 [==============================] - 1s 112ms/step - loss: 0.9897 - accuracy: 0.6754 - val_loss: 0.8374 - val_accuracy: 0.7200
Epoch 30/30
10/10 [==============================] - 1s 112ms/step - loss: 0.9083 - accuracy: 0.6874 - val_loss: 0.8395 - val_accuracy: 0.7200
1/1 [==============================] - 0s 916us/step - loss: 2.2212 - accuracy: 0.3177
testing
2.2211930751800537
0.3177257478237152