<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
35
25
10
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_18 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 10, 14, 64)        36928
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_18 (Conv2D)           (None, 184, 248, 32)      896
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 92, 124, 32)       0
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 45, 61, 64)        18496
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 22, 30, 64)        0
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 10, 14, 64)        36928
_________________________________________________________________
flatten_6 (Flatten)          (None, 8960)              0
_________________________________________________________________
dense_12 (Dense)             (None, 64)                573504
_________________________________________________________________
dense_13 (Dense)             (None, 10)                650
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
25/25 [==============================] - 1s 51ms/step - loss: 2.2679 - accuracy: 0.1423 - val_loss: 2.1922 - val_accuracy: 0.2250
Epoch 2/30
25/25 [==============================] - 1s 47ms/step - loss: 2.0898 - accuracy: 0.2365 - val_loss: 2.0949 - val_accuracy: 0.2250
Epoch 3/30
25/25 [==============================] - 1s 46ms/step - loss: 2.0557 - accuracy: 0.2525 - val_loss: 1.9439 - val_accuracy: 0.3050
Epoch 4/30
25/25 [==============================] - 1s 46ms/step - loss: 1.8589 - accuracy: 0.3166 - val_loss: 1.7020 - val_accuracy: 0.3600
Epoch 5/30
25/25 [==============================] - 1s 47ms/step - loss: 1.7786 - accuracy: 0.3347 - val_loss: 1.9185 - val_accuracy: 0.3050
Epoch 6/30
25/25 [==============================] - 1s 47ms/step - loss: 1.8042 - accuracy: 0.3447 - val_loss: 1.6878 - val_accuracy: 0.3700
Epoch 7/30
25/25 [==============================] - 1s 44ms/step - loss: 1.6148 - accuracy: 0.4148 - val_loss: 1.4664 - val_accuracy: 0.5350
Epoch 8/30
25/25 [==============================] - 1s 45ms/step - loss: 1.4956 - accuracy: 0.4469 - val_loss: 1.5453 - val_accuracy: 0.4450
Epoch 9/30
25/25 [==============================] - 1s 45ms/step - loss: 1.5123 - accuracy: 0.4589 - val_loss: 1.3936 - val_accuracy: 0.4550
Epoch 10/30
25/25 [==============================] - 1s 45ms/step - loss: 1.3986 - accuracy: 0.4770 - val_loss: 1.6290 - val_accuracy: 0.3900
Epoch 11/30
25/25 [==============================] - 1s 45ms/step - loss: 1.4283 - accuracy: 0.4689 - val_loss: 1.3902 - val_accuracy: 0.4850
Epoch 12/30
25/25 [==============================] - 1s 48ms/step - loss: 1.3322 - accuracy: 0.5170 - val_loss: 1.4479 - val_accuracy: 0.4750
Epoch 13/30
25/25 [==============================] - 1s 44ms/step - loss: 1.3398 - accuracy: 0.5251 - val_loss: 1.3233 - val_accuracy: 0.5050
Epoch 14/30
25/25 [==============================] - 1s 46ms/step - loss: 1.3340 - accuracy: 0.5130 - val_loss: 1.4484 - val_accuracy: 0.4750
Epoch 15/30
25/25 [==============================] - 1s 45ms/step - loss: 1.2428 - accuracy: 0.5471 - val_loss: 1.2354 - val_accuracy: 0.5850
Epoch 16/30
25/25 [==============================] - 1s 45ms/step - loss: 1.1955 - accuracy: 0.5691 - val_loss: 1.4174 - val_accuracy: 0.5200
Epoch 17/30
25/25 [==============================] - 1s 45ms/step - loss: 1.3145 - accuracy: 0.5170 - val_loss: 1.2697 - val_accuracy: 0.5400
Epoch 18/30
25/25 [==============================] - 1s 46ms/step - loss: 1.1424 - accuracy: 0.5992 - val_loss: 0.9942 - val_accuracy: 0.6350
Epoch 19/30
25/25 [==============================] - 1s 46ms/step - loss: 1.1274 - accuracy: 0.6112 - val_loss: 1.0389 - val_accuracy: 0.6400
Epoch 20/30
25/25 [==============================] - 1s 45ms/step - loss: 1.0454 - accuracy: 0.6413 - val_loss: 0.9039 - val_accuracy: 0.7150
Epoch 21/30
25/25 [==============================] - 1s 46ms/step - loss: 1.0196 - accuracy: 0.6333 - val_loss: 1.0957 - val_accuracy: 0.6300
Epoch 22/30
25/25 [==============================] - 1s 46ms/step - loss: 1.1211 - accuracy: 0.5752 - val_loss: 0.8383 - val_accuracy: 0.6900
Epoch 23/30
25/25 [==============================] - 1s 46ms/step - loss: 0.9449 - accuracy: 0.6754 - val_loss: 0.7384 - val_accuracy: 0.7450
Epoch 24/30
25/25 [==============================] - 1s 44ms/step - loss: 0.8517 - accuracy: 0.7134 - val_loss: 0.7985 - val_accuracy: 0.7050
Epoch 25/30
25/25 [==============================] - 1s 45ms/step - loss: 0.8452 - accuracy: 0.7054 - val_loss: 0.7738 - val_accuracy: 0.7350
Epoch 26/30
25/25 [==============================] - 1s 46ms/step - loss: 0.8483 - accuracy: 0.7174 - val_loss: 0.8468 - val_accuracy: 0.7000
Epoch 27/30
25/25 [==============================] - 1s 45ms/step - loss: 0.8619 - accuracy: 0.7114 - val_loss: 0.8299 - val_accuracy: 0.7150
Epoch 28/30
25/25 [==============================] - 1s 45ms/step - loss: 0.7001 - accuracy: 0.7756 - val_loss: 0.7592 - val_accuracy: 0.7250
Epoch 29/30
25/25 [==============================] - 1s 45ms/step - loss: 0.7051 - accuracy: 0.7595 - val_loss: 0.6599 - val_accuracy: 0.7700
Epoch 30/30
25/25 [==============================] - 1s 46ms/step - loss: 0.5951 - accuracy: 0.7996 - val_loss: 0.5249 - val_accuracy: 0.8150
1/1 [==============================] - 0s 888us/step - loss: 3.0890 - accuracy: 0.3311
testing
3.088982343673706
0.33110368251800537