<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
<TensorSliceDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<ShuffleDataset shapes: ((), ()), types: (tf.string, tf.int32)>
<MapDataset shapes: ((None, None, 3), ()), types: (tf.float32, tf.int32)>
<MapDataset shapes: ((370, 497, 3), ()), types: (tf.float32, tf.int32)>
<BatchDataset shapes: ((None, 370, 497, 3), (None,)), types: (tf.float32, tf.int32)>
dataset_size
7
5
2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 184, 248, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 92, 124, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 45, 61, 64)        18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 22, 30, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 14, 64)        36928     
=================================================================
Total params: 56,320
Trainable params: 56,320
Non-trainable params: 0
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 184, 248, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 92, 124, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 45, 61, 64)        18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 22, 30, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 14, 64)        36928     
_________________________________________________________________
flatten (Flatten)            (None, 8960)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                573504    
_________________________________________________________________
dense_1 (Dense)              (None, 10)                650       
=================================================================
Total params: 630,474
Trainable params: 630,474
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
1/5 [=====>........................] - ETA: 0s - loss: 2.3076 - accuracy: 0.08002/5 [===========>..................] - ETA: 9s - loss: 2.3124 - accuracy: 0.10003/5 [=================>............] - ETA: 7s - loss: 2.3140 - accuracy: 0.09334/5 [=======================>......] - ETA: 3s - loss: 2.3103 - accuracy: 0.09005/5 [==============================] - ETA: 0s - loss: 2.3072 - accuracy: 0.09225/5 [==============================] - 23s 5s/step - loss: 2.3072 - accuracy: 0.0922 - val_loss: 2.2790 - val_accuracy: 0.1750
Epoch 2/30
1/5 [=====>........................] - ETA: 0s - loss: 2.2809 - accuracy: 0.13002/5 [===========>..................] - ETA: 6s - loss: 2.2577 - accuracy: 0.17003/5 [=================>............] - ETA: 5s - loss: 2.2620 - accuracy: 0.16334/5 [=======================>......] - ETA: 2s - loss: 2.2490 - accuracy: 0.16255/5 [==============================] - ETA: 0s - loss: 2.2381 - accuracy: 0.17235/5 [==============================] - 20s 4s/step - loss: 2.2381 - accuracy: 0.1723 - val_loss: 2.2617 - val_accuracy: 0.1350
Epoch 3/30
1/5 [=====>........................] - ETA: 0s - loss: 2.2678 - accuracy: 0.11002/5 [===========>..................] - ETA: 5s - loss: 2.2023 - accuracy: 0.13503/5 [=================>............] - ETA: 4s - loss: 2.1850 - accuracy: 0.17004/5 [=======================>......] - ETA: 2s - loss: 2.1746 - accuracy: 0.19505/5 [==============================] - ETA: 0s - loss: 2.1820 - accuracy: 0.20845/5 [==============================] - 17s 3s/step - loss: 2.1820 - accuracy: 0.2084 - val_loss: 2.1558 - val_accuracy: 0.2100
Epoch 4/30
1/5 [=====>........................] - ETA: 0s - loss: 2.1161 - accuracy: 0.21002/5 [===========>..................] - ETA: 5s - loss: 2.1065 - accuracy: 0.2150